app/controllers/items_controller.rb

  def index
  #  @items = if params[:request]
      #fields = if params[:fields] == "all_columns"
      #  %w(login_name first_name last_name role)
      #else
      #  params[:fields]
     # end
     # item.send params[:scope].intern, fields, params[:request]
  #  else
   #   item.scoped
   # end

   # @items = @items.reorder(params[:itemBy]).page(params[:currentPage]).per(params[:perPage])

   # @pagination = {
      #current_page: @items.current_page,
      #num_pages:    @items.num_pages,
     # per_page:     @items.limit_value,
     # total_count:  item.count,
   # }
    @items = Item.all
---
SELECT "items".* FROM "items"