app/controllers/orders_controller.rb

  def create
    @order = Order.new(params[:order])

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("created_at", "credit_card_number", "credit_card_type", "cvv2", "date_of_ordering", "delivery_date", "expiry_date", "issue_number", "max_discount", "order_number", "pref_delivery_date", "role", "start_date", "status", "total_num_of_items", "total_price", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)