app/controllers/order_items_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "1"]]
SELECT item_id,item_name,item_description,dimension,price,quantity,price_per_line FROM "items" INNER JOIN "order_items" ON "items"."id" = "order_items"."item_id" WHERE "order_items"."order_id" = 1
---
  def index
  #  @order_items = if params[:request]
      #fields = if params[:fields] == "all_columns"
      #  %w(login_name first_name last_name role)
      #else
      #  params[:fields]
     # end
     # order_item.send params[:scope].intern, fields, params[:request]
  #  else
   #   order_item.scoped
   # end

   # @order_items = @order_items.reorder(params[:itemstableBy]).page(params[:currentPage]).per(params[:perPage])

   # @pagination = {
      #current_page: @order_items.current_page,
      #num_pages:    @order_items.num_pages,
     # per_page:     @order_items.limit_value,
     # total_count:  order_item.count,
   # }
    @order = Order.find params[:order_id]

    @all_items = @order.items.select("item_id,item_name,item_description,dimension,price,quantity,price_per_line")