app/controllers/users_controller.rb

  def index
    @users = if params[:request]
      fields = if params[:fields] == "all_columns"
        %w(login_name first_name last_name role)
      else
        params[:fields]
      end
      User.send params[:scope].intern, fields, params[:request]
    else
      User.scoped
    end

    @users = @users.reorder(params[:orderBy]).page(params[:currentPage]).per(params[:perPage])

    @pagination = {
      current_page: @users.current_page,
      num_pages:    @users.num_pages,
      per_page:     @users.limit_value,
      total_count:  User.count,
    }
---
SELECT COUNT(*) FROM "users" WHERE (login_name != 'z' OR first_name != 'z' OR last_name != 'z' OR role != 'z')

  def show
    @user = User.find params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY id asc LIMIT 1

  def create
    @user = User.create params[:user]
---
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "failed_attempts", "first_name", "last_name", "last_sign_in_at", "last_sign_in_ip", "locked_at", "login_name", "region", "remember_created_at", "reset_password_sent_at", "reset_password_token", "role", "sign_in_count", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find params[:id]
    @user.update_attributes params[:user]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY id asc LIMIT 1  [["id", "1"]]
UPDATE "users" SET "first_name" = 'darkFOOO', "last_name" = 'darkBAAARRR', "region" = 'South', "role" = 'Merchandiser', "updated_at" = '2013-02-11 20:21:57.759989' WHERE "users"."id" = 31

  def destroy
    respond_with User.destroy(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]